Revit 2027 API
UIMacroManager.AddModule Method
 Adds a MacroModule to the application.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MacroModule AddModule(
	ModuleSettings moduleSettings,
	MacroEnvironment environment,
	IModuleMaker maker
)
Public Function AddModule (
	moduleSettings As ModuleSettings,
	environment As MacroEnvironment,
	maker As IModuleMaker
) As MacroModule
public:
MacroModule^ AddModule(
	ModuleSettings^ moduleSettings,
	MacroEnvironment environment,
	IModuleMaker^ maker
)
member AddModule :
        moduleSettings : ModuleSettings *
        environment : MacroEnvironment *
        maker : IModuleMaker -> MacroModule
Parameters
moduleSettings ModuleSettings
 The module settings.
environment MacroEnvironment
 The module environment.
maker IModuleMaker
 The interface to create module project.
Return Value
MacroModule
 The new module.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the module name is duplicated with the existing one, or the name is too long, or the name contains invalid identifier(s), such as include "#", "%", ... and key words in C#.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace